lukascakici/visor/Firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth Low Energy only, and only as a peripheral. The display never scans
# for anything and never connects to anything; it waits to be found.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# One number decides how much road fits in a packet. At the default 23 a write
# carries four points and nine letters of a street name.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
